### Домашнее задание «Библиотека Pandas»

#### Задание 1
Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [1]:
import pandas as pd

In [2]:
ratings = pd.read_csv('ml-latest-small/ratings.csv')
ratings.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [3]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100836 entries, 0 to 100835
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   userId     100836 non-null  int64
 1   movieId    100836 non-null  int64
 2   rating     100836 non-null  float64
 3   timestamp  100836 non-null  int64
dtypes: float64(1), int64(3)
memory usage: 3.1 MB

In [4]:
movies = pd.read_csv('ml-latest-small/movies.csv')
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [5]:
fivestars = ratings[ratings.rating == 5].groupby('movieId').count().sort_values('rating', ascending=False)
fivestars.head()

         userId  rating  timestamp
movieId
318         153     153        153
296         123     123        123
356         116     116        116
2571        109     109        109
260         104     104        104

In [6]:
joined = fivestars.merge(movies, on='movieId', how='left')
joined.head()

,movieId,userId,rating,timestamp,title,genres
0,318,153,153,153,"Shawshank Redemption, The (1994)",Crime|Drama
1,296,123,123,123,Pulp Fiction (1994),Comedy|Crime|Drama|Thriller
2,356,116,116,116,Forrest Gump (1994),Comedy|Drama|Romance|War
3,2571,109,109,109,"Matrix, The (1999)",Action|Sci-Fi|Thriller
4,260,104,104,104,Star Wars: Episode IV - A New Hope (1977),Action|Adventure|Sci-Fi

In [7]:
print(f'Mаксимальное количество оценок "5" получил фильм {joined.title[0]}')

Mаксимальное количество оценок "5" получил фильм Shawshank Redemption, The (1994)

#### Задание 2
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [8]:
data=pd.read_csv('C:/ds22/1_pyda/10_pandas/10_data/power.csv')
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1189482 entries, 0 to 1189481
Data columns (total 4 columns):
 #   Column    Non-Null Count    Dtype
---  ------    --------------    -----
 0   country   1189482 non-null  object
 1   year      1189482 non-null  int64
 2   quantity  1189482 non-null  float64
 3   category  1189482 non-null  int64
dtypes: float64(1), int64(2), object(1)
memory usage: 36.3+ MB

In [9]:
data[data['country'].str.contains('est', case=False)]['country'].unique()

array(['Estonia', 'State of Palestine', 'Timor-Leste'], dtype=object)

In [10]:
#сохраним данные для стран Прибалтики в отдельном датасете
country_list = ['Latvia','Lithuania','Estonia']
data_pr = data[data['country'].isin(country_list)]
data_pr.sort_values('quantity').head()

       country  year  quantity  category
831930  Latvia  2010  -25993.0        42
831947  Latvia  1993  -17560.0        42
831926  Latvia  2014  -14027.0        42
831932  Latvia  2008  -11062.0        42
831939  Latvia  2001   -8503.0        42

In [11]:
category_list = [4,12,21]
data_pr = data_pr[(data_pr['year'] >= 2005) & (data_pr['year'] <= 2010) & data_pr['category'].isin(category_list)  & (data_pr['quantity'] >= 0)]
total = data_pr['quantity'].sum()
print(f'Cуммарное потребление стран Прибалтики категорий 4, 12 и 21 за период с 2005 по 2010 года - {total}')

Cуммарное потребление стран Прибалтики категорий 4, 12 и 21 за период с 2005 по 2010 года - 240580.0

#### Задание 3
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.  
Примеры страниц (необязательно брать именно эти):  
https://fortrader.org/quotes  
https://www.finanz.ru/valyuty/v-realnom-vremeni

In [12]:
page_url = 'https://www.finanz.ru/valyuty/v-realnom-vremeni'

df = pd.read_html(page_url, attrs = {'class': 'quote_list'}, encoding='utf-8')[0]
df.head()

,Unnamed: 0,Рубль,Предложение,Спрос,Предыдущее закрытие,%,Абсолютное значение,Время
0,NaN,GBP/RUB,1012049,-,1011455,"0,06 %",00595,07:05:00
1,NaN,EUR/RUB,904123,-,914355,"-1,12 %",-10232,01.01.2021
2,NaN,USD/RUB,740235,-,743485,"-0,44 %",-03250,01.01.2021
3,NaN,JPY/RUB,07171,-,07166,"0,08 %",00005,07:05:00
4,NaN,CNY/RUB,113394,-,113319,"0,07 %",00075,07:05:00